print("รับค่า * เข้ามาหนึ่งครั้ง จากนั้นรับตัวเลขจํานวนเต็ม แล้วให้แสดงผลลัพธ์ดังนี้")
print("Input = * และ 10 output ********** ")
symbol = input("สัญญาลักษณ์:")
n = int(input("จำนวนเต็ม:"))
output=symbol * n
print(output)

print("เขียนโปรแกรมรับจํานวนคะแนนสอบกลางภาค และปลายภาค ซึ่งแต่ละครั้งมีคะแนนและค่าเฉลี่ยของคะแนนนสอบทั้งสองครั้ง")
midterm = float(input("Enter midterm score (0 <= midterm <= 60): "))
final = float(input("Enter final score (0 <= final <= 60): "))
mix = midterm+final
Average = mix/2
print(f"Total: {mix}")
print(f"Average: {Average}")

print("กําหนดให้สระว่ายน้ํา เป็นรูปสี่เหลี่ยมผืนผ้า โดยเราต้องการเติมน้ําลงไปในสระให้เต็ม จงเขียนโปรแกรมเพื่อรับความกว้าง ความยาว และความลึกของสระในหน่วยเมตร เพื่อคํานวณว่าต้องใช้เวลากี่นาทีในการเติมน้ําลงในสระให้เต็ม เมื่อกําหนดให้ใช้เวลา 15 วินาทีในการเติมน้ํา 1ลูกบาศก์เมตร แสดงคําตอบด้วยทศนิยมสองตําแหน่ง")
กว้าง = float(input("กว้าง:"))
ยาว = float(input("ยาว:"))
ลึก = float(input("ลึก:"))
เวลา =float(input("อัตราเร็ว1ลม./เวลาเป็นวินาที:"))
aos=กว้าง * ยาว * ลึก
print(aos)
s=เวลา/60
ans=aos*s
print('{:.2f}'.format(ans))
